import type { Station } from './yamanote';

// JR内房線
export const jrUchiboLine: Station[] = [
  { name: "蘇我", lat: 35.582323, lng: 140.130653 },
  { name: "浜野", lat: 35.552100, lng: 140.132185 },
  { name: "八幡宿", lat: 35.536160, lng: 140.120035 },
  { name: "五井", lat: 35.513115, lng: 140.089745 },
  { name: "姉ケ崎", lat: 35.478650, lng: 140.041933 },
  { name: "長浦", lat: 35.450285, lng: 139.995425 },
  { name: "袖ケ浦", lat: 35.431905, lng: 139.957210 },
  { name: "巌根", lat: 35.414785, lng: 139.933805 },
  { name: "木更津", lat: 35.381740, lng: 139.926144 },
  { name: "君津", lat: 35.333645, lng: 139.895515 },
  { name: "青堀", lat: 35.330565, lng: 139.858880 },
  { name: "大貫", lat: 35.291625, lng: 139.855625 },
  { name: "佐貫町", lat: 35.259985, lng: 139.876140 },
  { name: "上総湊", lat: 35.221830, lng: 139.870995 },
  { name: "竹岡", lat: 35.197590, lng: 139.830030 },
  { name: "浜金谷", lat: 35.168195, lng: 139.822260 },
  { name: "保田", lat: 35.141465, lng: 139.838160 },
  { name: "安房勝山", lat: 35.114065, lng: 139.833410 },
  { name: "岩井", lat: 35.093050, lng: 139.849870 },
  { name: "富浦", lat: 35.046230, lng: 139.837755 },
  { name: "館山", lat: 34.995915, lng: 139.861990 }
];

// JR外房線
export const jrSotoboLine: Station[] = [
  { name: "千葉", lat: 35.613556, lng: 140.113490 },
  { name: "本千葉", lat: 35.600390, lng: 140.121533 },
  { name: "蘇我", lat: 35.582323, lng: 140.130653 },
  { name: "鎌取", lat: 35.562713, lng: 140.178675 },
  { name: "誉田", lat: 35.547000, lng: 140.213785 },
  { name: "土気", lat: 35.530903, lng: 140.269820 },
  { name: "大網", lat: 35.522388, lng: 140.311138 },
  { name: "永田", lat: 35.503343, lng: 140.311283 },
  { name: "本納", lat: 35.482160, lng: 140.307570 },
  { name: "新茂原", lat: 35.449430, lng: 140.299715 },
  { name: "茂原", lat: 35.426830, lng: 140.304070 },
  { name: "八積", lat: 35.403955, lng: 140.345355 },
  { name: "上総一ノ宮", lat: 35.374685, lng: 140.365525 },
  { name: "東浪見", lat: 35.346770, lng: 140.376650 },
  { name: "太東", lat: 35.320095, lng: 140.381290 },
  { name: "長者町", lat: 35.296260, lng: 140.384810 },
  { name: "三門", lat: 35.282920, lng: 140.391445 },
  { name: "大原", lat: 35.250847, lng: 140.391033 }
];

// JR成田線
export const jrNaritaLine: Station[] = [
  { name: "千葉", lat: 35.613556, lng: 140.113490 },
  { name: "東千葉", lat: 35.616977, lng: 140.122193 },
  { name: "都賀", lat: 35.635495, lng: 140.148745 },
  { name: "四街道", lat: 35.662908, lng: 140.165200 },
  { name: "物井", lat: 35.685725, lng: 140.200315 },
  { name: "佐倉", lat: 35.709740, lng: 140.226755 },
  { name: "酒々井", lat: 35.731850, lng: 140.275405 },
  { name: "成田", lat: 35.776560, lng: 140.313346 },
  { name: "久住", lat: 35.832185, lng: 140.338870 },
  { name: "滑河", lat: 35.877060, lng: 140.347865 },
  { name: "下総神崎", lat: 35.894845, lng: 140.410670 },
  { name: "大戸", lat: 35.889930, lng: 140.457730 },
  { name: "佐原", lat: 35.894930, lng: 140.493770 },
  { name: "香取", lat: 35.897885, lng: 140.532410 },
  { name: "水郷", lat: 35.885455, lng: 140.570175 },
  { name: "小見川", lat: 35.849980, lng: 140.604600 },
  { name: "笹川", lat: 35.839430, lng: 140.655825 },
  { name: "下総橘", lat: 35.818785, lng: 140.702150 },
  { name: "下総豊里", lat: 35.793005, lng: 140.720895 },
  { name: "椎柴", lat: 35.765217, lng: 140.758863 },
  { name: "銚子", lat: 35.729325, lng: 140.827465 }
];