import type { Station } from './yamanote';

// 東急目黒線
export const tokyuMeguro: Station[] = [
  { name: "目黒", lat: 35.633406, lng: 139.715727 },
  { name: "不動前", lat: 35.625423, lng: 139.713150 },
  { name: "武蔵小山", lat: 35.620510, lng: 139.704470 },
  { name: "西小山", lat: 35.615435, lng: 139.698710 },
  { name: "洗足", lat: 35.610090, lng: 139.694105 },
  { name: "大岡山", lat: 35.607070, lng: 139.684857 },
  { name: "奥沢", lat: 35.603945, lng: 139.672410 },
  { name: "田園調布", lat: 35.597290, lng: 139.667285 },
  { name: "多摩川", lat: 35.589410, lng: 139.668760 },
  { name: "新丸子", lat: 35.580460, lng: 139.661940 },
  { name: "武蔵小杉", lat: 35.576563, lng: 139.659807 },
  { name: "元住吉", lat: 35.565705, lng: 139.654715 },
  { name: "日吉", lat: 35.553325, lng: 139.646840 }
];

// 東急多摩川線
export const tokyuTamagawa: Station[] = [
  { name: "多摩川", lat: 35.589410, lng: 139.668760 },
  { name: "沼部", lat: 35.582490, lng: 139.673170 },
  { name: "鵜の木", lat: 35.575385, lng: 139.680550 },
  { name: "下丸子", lat: 35.571325, lng: 139.685490 },
  { name: "武蔵新田", lat: 35.567755, lng: 139.692435 },
  { name: "矢口渡", lat: 35.562450, lng: 139.700340 },
  { name: "蒲田", lat: 35.561770, lng: 139.714590 }
];

// 東急池上線
export const tokyuIkegami: Station[] = [
  { name: "五反田", lat: 35.626060, lng: 139.723696 },
  { name: "大崎広小路", lat: 35.622305, lng: 139.722355 },
  { name: "戸越銀座", lat: 35.616010, lng: 139.715000 },
  { name: "荏原中延", lat: 35.609900, lng: 139.712030 },
  { name: "旗の台", lat: 35.604930, lng: 139.702210 },
  { name: "長原", lat: 35.602230, lng: 139.697970 },
  { name: "洗足池", lat: 35.599675, lng: 139.690925 },
  { name: "石川台", lat: 35.596860, lng: 139.685090 },
  { name: "雪が谷大塚", lat: 35.591965, lng: 139.681125 },
  { name: "御嶽山", lat: 35.585153, lng: 139.682420 },
  { name: "久が原", lat: 35.579455, lng: 139.685670 },
  { name: "千鳥町", lat: 35.573000, lng: 139.691420 },
  { name: "池上", lat: 35.571945, lng: 139.702843 },
  { name: "蓮沼", lat: 35.563960, lng: 139.708600 },
  { name: "蒲田", lat: 35.561770, lng: 139.714590 }
];